perftests/run2.log
hey -z 30s -m GET -cpus 4 -c 200 -H "Authorization: icandowhatiwant" http://localhost:9000/performance

Summary:
  Total:	30.0055 secs
  Slowest:	0.0933 secs
  Fastest:	0.0000 secs
  Average:	0.0090 secs
  Requests/sec:	22290.5159
  
  Total data:	79583273 bytes
  Size/request:	119 bytes

Response time histogram:
  0.000 [1]	|
  0.009 [410972]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [179771]	|■■■■■■■■■■■■■■■■■
  0.028 [57913]	|■■■■■■
  0.037 [15362]	|■
  0.047 [3714]	|
  0.056 [820]	|
  0.065 [160]	|
  0.075 [41]	|
  0.084 [7]	|
  0.093 [6]	|


Latency distribution:
  10% in 0.0011 secs
  25% in 0.0027 secs
  50% in 0.0070 secs
  75% in 0.0129 secs
  90% in 0.0198 secs
  95% in 0.0246 secs
  99% in 0.0351 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0933 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0013 secs
  resp wait:	0.0090 secs, 0.0000 secs, 0.0932 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0012 secs

Status code distribution:
  [400]	668767 responses

Error distribution:
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64368->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64371->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64372->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64373->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64374->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64375->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64376->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64377->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64378->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64379->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64380->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64381->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64382->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64383->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64384->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64385->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64386->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64387->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64388->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64389->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64390->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64391->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64392->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64393->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64394->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64395->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64396->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64397->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64398->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64399->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64400->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64401->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64402->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64403->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64404->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64405->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64406->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64407->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64408->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64409->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64410->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64411->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64412->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64413->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64414->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64415->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64416->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64417->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64418->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64419->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64420->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64421->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64422->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64423->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64424->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64425->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64426->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64427->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64428->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64429->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64430->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64431->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64432->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64433->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64434->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64435->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64436->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64437->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64438->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:64439->[::1]:9000: read: connection reset by peer